{"schema":5,"addons":[{"id":"user-agent-switcher@ninetailed.ninja","icons":{"32":"https://addons.cdn.mozilla.net/user-media/addon_icons/812/812521-32.png?modified=1569624433","64":"https://addons.cdn.mozilla.net/user-media/addon_icons/812/812521-64.png?modified=1569624433","128":"https://addons.cdn.mozilla.net/user-media/addon_icons/812/812521-128.png?modified=1569624433"},"name":"User-Agent Switcher","version":"1.3.23","sourceURI":"https://addons.mozilla.org/firefox/downloads/file/3501455/user_agent_switcher-1.3.23-an+fx.xpi?src=","homepageURL":"https://gitlab.com/ntninja/user-agent-switcher","supportURL":"https://gitlab.com/ntninja/user-agent-switcher/issues","description":"Easily override the browser's User-Agent string","fullDescription":"Easily pose as another browser by changing the User-Agent header.*\n\nPretending to be a different browser can be useful in a number of different situations:\n\n    Some web pages require you to log in or buy a subscription to view their content, but give full read access to search engines.\n    Some web pages determine whether you're using a mobile or desktop browser based on your user-agent.\n    Some web pages require you to use a specific browser to access their site.\n    And potentially more…\n\nNote that your browser will not magically morph into a different piece of software just because it's pretending to be some other software. If a web site locks you out because your browser does not support a feature they require then changing the User-Agent will not make any difference.\n\n* Also changes navigator.userAgent, as well generating convincing values for several of the other navigator.* properties.\n\n– Translating “User-Agent Switcher” to a new language\nAny help in translating this extension is greatly appreciated! To do so, simply visit our project on the WebLate hosted instance, create an account and either select an existing language or add a new one to get going. Thanks for helping out!\n\n(Alternatively you may submit a merge request on GitLab with the updated translation files or send me the translations using the “Support E-mail”-Address.)\n\n– Getting Help\nFound a bug or want a new feature? Please use the GitLab issue tracker to submit these instead of just mentioning them as part of your reviews. This way it becomes much easier for me to keep track of reported issues and get back to you if additional information is needed to help you.\n\nPlease note however that “User-Agent Switcher” is mostly in maintenance-only mode now and new features will not be added by me (the primary author, Alexander Schlarb) anymore. I'm still open for patches from the community however and would also welcome your support through the linked BountySource buttons under each Feature Request issue in the tracker.\n\n– Watching it work\nIf you want to watch User Agent Changer work, there are a few things you could try:\n\n    Use a web service (such as UserAgentString.com) to see your currently sent User-Agent header.\n    Use the built-in Network Analyzer (Ctrl-Shift-Q) to view the User-Agent header.\n    Enter navigator.userAgent into the Scripting Console (Ctrl-Shift-K) to view the client-side User-Agent value.\n\n\n– Frequently Asked Questions\n\n    Why doesn't the extension work on this very site (Mozilla/Firefox Add-ons)?\n\n    To find out more about why these restrictions exist and how disable them if you must, please take a look at the following blog article: https://ninetailed.ninja/extensions-modify-mozilla-sites.html\n\n    (This information was moved from this extension's description to an external source, since a Mozilla reviewer felt that suggesting changes like the one proposed in the linked article are not acceptable for the listing of sandboxed browser extension.)\n    Why is the extension file so large (4 MiB) compared to others?\n\n    In order to provide almost perfect emulation of User-Agent values, User Agent-Switcher bundles a stripped-down version of BrowsCap. This allows us to derive all relevant JavaScript navigator.* browser/OS identification values from just a single value: The User-Agent value you enter (and a bit of magic behind the scenes). Other extensions with a similarly complete level of emulation used to store all these values in huge tables along with the User-Agent value itself, making it very hard to add new entries.\n\n    Doing this kind of emulation without using BrowsCap would be extremely hard for us, as there are only few rules regarding the structure of User-Agent strings and the most interesting part end up in the extremely browser-specific comment section of the string. As such, we consider these extra 3MiB+ of data shipped with the extension a fair price to pay for having almost perfect out-of-the-box emulation of all these values with no extra user configuration required.\n\n    And yes, the BrowsCap data is here to stay and if you cannot cope with the extra size this causes please kindly download a different extension and don't down-vote. Other people appreciate this decision even if you don't.","weeklyDownloads":7539,"type":"extension","creator":{"name":"Alexander Schlarb","url":"https://addons.mozilla.org/vi/firefox/user/5622055/"},"developers":[],"screenshots":[{"url":"https://addons.cdn.mozilla.net/user-media/previews/full/187/187816.png?modified=1543520827","width":341,"height":525,"thumbnailURL":"https://addons.cdn.mozilla.net/user-media/previews/thumbs/187/187816.png?modified=1543520827","thumbnailWidth":312,"thumbnailHeight":480,"caption":"Icon with Popup Menu"},{"url":"https://addons.cdn.mozilla.net/user-media/previews/full/187/187814.png?modified=1543520828","width":299,"height":525,"thumbnailURL":"https://addons.cdn.mozilla.net/user-media/previews/thumbs/187/187814.png?modified=1543520828","thumbnailWidth":273,"thumbnailHeight":480,"caption":"Random User-Agent Mode"},{"url":"https://addons.cdn.mozilla.net/user-media/previews/full/187/187817.png?modified=1543520829","width":700,"height":408,"thumbnailURL":"https://addons.cdn.mozilla.net/user-media/previews/thumbs/187/187817.png?modified=1543520829","thumbnailWidth":640,"thumbnailHeight":373,"caption":"Preferences (Table Mode)"},{"url":"https://addons.cdn.mozilla.net/user-media/previews/full/187/187818.png?modified=1543520830","width":700,"height":408,"thumbnailURL":"https://addons.cdn.mozilla.net/user-media/previews/thumbs/187/187818.png?modified=1543520830","thumbnailWidth":640,"thumbnailHeight":373,"caption":"Preferences (Text Mode)"}],"contributionURL":"","averageRating":4.4078,"reviewCount":132,"reviewURL":"https://addons.mozilla.org/vi/firefox/addon/uaswitcher/reviews/","updateDate":1581080713000}],"compatOverrides":[]}